# Pandas Exercises
 Date: 23/09/2022

1. Combine many series to form a dataframe?

In [1]:
import pandas as pd
import numpy as np
from dateutil.parser import parse

In [2]:
ser1=pd.Series(list('abcdefghijklmnopqrstuvwxyz'))
ser2=pd.Series(np.arange(26))

In [3]:
ser1

0     a
1     b
2     c
3     d
4     e
5     f
6     g
7     h
8     i
9     j
10    k
11    l
12    m
13    n
14    o
15    p
16    q
17    r
18    s
19    t
20    u
21    v
22    w
23    x
24    y
25    z
dtype: object

In [4]:
ser2

0      0
1      1
2      2
3      3
4      4
5      5
6      6
7      7
8      8
9      9
10    10
11    11
12    12
13    13
14    14
15    15
16    16
17    17
18    18
19    19
20    20
21    21
22    22
23    23
24    24
25    25
dtype: int32

In [5]:
df=pd.DataFrame({'ser1':ser1,'ser2':ser2})

In [6]:
df.head()

  ser1  ser2
0    a     0
1    b     1
2    c     2
3    d     3
4    e     4

2. Get items of series A not present in series B?

In [7]:
ser1=pd.Series([1,2,3,4,5])
ser2=pd.Series([4,5,6,7,8])
ser3=[]
for i in range(0,len(ser1)):
    for j in range(0,len(ser2)):
        if ser1[i]==ser2[j]:
            ser3.append(ser1[i])
ser3

[4, 5]

3.  How to get the items not common to both series A and series B?

In [8]:
ser1 = pd.Series([1, 2, 3, 4, 5])
ser2 = pd.Series([4, 5, 6, 7, 8])
ser3=[] 
ser3.append(np.union1d(ser1,ser2))
print(ser3)

[array([1, 2, 3, 4, 5, 6, 7, 8], dtype=int64)]

4. To find the positions of numbers that are multiples of 3 from a series

In [9]:
ser=pd.Series(np.random.randint(1,10,7))
ser
for i in range(len(ser)):
    if ser[i]%3==0:
        print(f"position of the multiple of 3 is in {i} which has the multiple {ser[i]}")

position of the multiple of 3 is in 1 which has the multiple 3
position of the multiple of 3 is in 6 which has the multiple 9

5. How to extract items at given positions from a series

In [10]:
ser = pd.Series(list('abcdefghijklmnopqrstuvwxyz'))
pos = [0, 4, 8, 14, 20]
for i in pos:
    print(ser[i])

a
e
i
o
u

6. How to convert the first character of each element in a series to uppercase?

In [11]:
ser = pd.Series(['how', 'to', 'kick', 'ass?'])
for i in range(len(ser)):
    print(ser[i].title())

How
To
Kick
Ass?

7. How to calculate the number of characters in each word in a series?

In [12]:
ser=pd.Series(['how','to','kick','ass?'])
for i in range(len(ser)):
    print(len(ser[i]))

3
2
4
4

8. How to compute difference of differences between consequtive numbers of a series?

In [13]:
ser = pd.Series([1, 3, 6, 10, 15, 21, 27,35])
print(ser.diff().tolist())
print(ser.diff().diff().tolist())

[nan, 2.0, 3.0, 4.0, 5.0, 6.0, 6.0, 8.0]
[nan, nan, 1.0, 1.0, 1.0, 1.0, 0.0, 2.0]

9. How to convert a numpy array to a dataframe of given shape?

In [14]:
ser=pd.Series(np.random.randint(1,10,35))
df=pd.DataFrame(ser.values.reshape(7,5))
df

   0  1  2  3  4
0  6  8  7  6  7
1  9  9  9  5  1
2  6  6  8  3  4
3  4  2  5  3  2
4  8  1  6  7  8
5  5  2  8  7  8
6  2  7  6  9  9

10. How to stack two series vertically and horizontally?

In [15]:
ser1=pd.Series(range(5))
ser2=pd.Series(list('abcde'))
ser1.append(ser2)
hs=pd.concat([ser1,ser2],axis=1)
print(ser1)
print(hs)

0    0
1    1
2    2
3    3
4    4
dtype: int64
   0  1
0  0  a
1  1  b
2  2  c
3  3  d
4  4  e

C:\Users\Msc 1\AppData\Local\Temp\ipykernel_1312\1421675151.py:3: FutureWarning: The series.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  ser1.append(ser2)

11. How to convert a series of date-strings to a timeseries?

In [16]:
ser=pd.Series(['01 Jan 2010', '02-02-2011', '20120303', '2013/04/04', '2014-05-05', '2015-06-06T12:20'])
pd.to_datetime(ser)

0   2010-01-01 00:00:00
1   2011-02-02 00:00:00
2   2012-03-03 00:00:00
3   2013-04-04 00:00:00
4   2014-05-05 00:00:00
5   2015-06-06 12:20:00
dtype: datetime64[ns]

12. How to filter words that contain atleast 2 volwels from a series?

In [17]:
from collections import Counter
ser=pd.Series(['Apple','Orange','Plan','Python','Money'])

mask = ser.map(lambda x: sum([Counter(x.lower()).get(i, 0) for i in list('aeiou')]) >= 2)
ser[mask]

0     Apple
1    Orange
4     Money
dtype: object

13. How to filter valid emails from a series?

In [18]:
import re
emails = pd.Series(['buying books at amazom.com', 'rameses@egypt.com', 'matt@t.co', 'narendra@modi.com'])
pattern ='[A-Za-z0-9._%+-]+@[A-Za-z0-9.-]+\\.[A-Za-z]{2,4}'
mask=emails.map(lambda x: bool(re.search(pattern,x,re.IGNORECASE)))
emails[mask]

1    rameses@egypt.com
2            matt@t.co
3    narendra@modi.com
dtype: object

14. How to assign name to series' index?

In [19]:
ser=pd.Series(list('abcdefghijklmonpqrstuvwxyz'))
ser.name='alphabets'
ser.head()

0    a
1    b
2    c
3    d
4    e
Name: alphabets, dtype: object

15. How to get the minimum, 25th percentile,median,75th, and max of a numeric series?

In [20]:
ser=pd.Series(np.random.normal(10,5,25))
mini=0
maximum=0
print(ser)
np.percentile(ser,q=[0,25,50,75,100])

0     11.383910
1      0.320913
2     10.342146
3      4.736834
4      3.498469
5     15.192389
6      8.449520
7      8.924377
8     13.421016
9      9.874630
10     5.414442
11    11.392045
12    16.008246
13    15.673256
14     9.111691
15    10.181377
16    21.389584
17     7.124431
18     6.548270
19     9.084945
20    14.252399
21    10.258997
22     0.297043
23    11.309581
24    14.964132
dtype: float64

array([ 0.29704283,  7.12443086, 10.18137673, 13.42101605, 21.38958389])

16. How to import pandas and check the version?

In [21]:
print(pd.__version__)

1.4.3

17. How to create a series from a list, numpy array and dict?

In [22]:
mylist = list('abcedfghijklmnopqrstuvwxyz')
myarr = np.arange(26)
mydict = dict(zip(mylist, myarr))
ser1 = pd.Series(mylist)
ser2 = pd.Series(myarr)
ser3 = pd.Series(mydict)
print(ser3.head())

a    0
b    1
c    2
e    3
d    4
dtype: int32

18. How to convert the index of a series into a column of a dataframe?

In [23]:
mylist = list('abcedfghijklmnopqrstuvwxyz')
myarr = np.arange(26)
mydict = dict(zip(mylist, myarr))
ser = pd.Series(mydict)
df = ser.to_frame().reset_index()
print(df.head())

  index  0
0     a  0
1     b  1
2     c  2
3     e  3
4     d  4

19. How to get frequency counts of unique items of a series?

In [24]:
ser = pd.Series(np.take(list('abcdefgh'), np.random.randint(8, size=30)))
ser.value_counts()

c    5
g    5
a    4
f    4
b    4
e    3
h    3
d    2
dtype: int64

20. How to keep only 2 most frequent values as it is and replace everything else as 'Other'?

In [25]:
np.random.RandomState(100)
ser=pd.Series(np.random.randint(1,5,[12]))
ser[~ser.isin(ser.value_counts().index[:2])]='Other'
ser

0     Other
1     Other
2         1
3         1
4         3
5         3
6         3
7     Other
8         3
9         3
10        1
11        3
dtype: object

21. How to bin a numeric series to 10 groups of equal size?

In [26]:
ser=pd.Series(np.random.random(20))
print(ser.head())
pd.qcut(ser,q=[0,.10,.20,.3,.4,.5,.6,.7,.8,.9,1],labels=['1st',
                                                        '2nd',
                                                        '3rd',
                                                        '4th',
                                                        '5th',
                                                        '6th',
                                                        '7th',
                                                        '8th',
                                                        '9th',
                                                        '10th']).head()

0    0.476175
1    0.219840
2    0.738766
3    0.314422
4    0.223038
dtype: float64

0    8th
1    4th
2    9th
3    6th
4    4th
dtype: category
Categories (10, object): ['1st' < '2nd' < '3rd' < '4th' ... '7th' < '8th' < '9th' < '10th']

22. How to get the positions of items of series A in another series B?

In [27]:
ser1 = pd.Series([10, 9, 6, 5, 3, 1, 12, 8, 13])
ser2 = pd.Series([1, 3, 10, 13])
for i in ser2:
    print(pd.Index(ser1).get_loc(i))

5
4
0
8

23. How to compute the mean squared error on a truth and predicted series?

In [28]:
truth = pd.Series(range(10))
pred = pd.Series(range(10)) + np.random.random(10)
np.mean((truth-pred)**2)

0.5600634380537619

24.  How to convert year-month string to dates corresponding to the 4th day of the month?

In [29]:
ser=pd.Series(['Jan 2010','Feb 2011','Mar 2013'])
ser_ts=ser.map(lambda x: parse(x))
ser_datestr=ser_ts.dt.year.astype('str')+'-'+ser_ts.dt.month.astype('str')+'-'+'04'
[parse(i).strftime('%Y-%m-%d') for i in ser_datestr]

['2010-01-04', '2011-02-04', '2013-03-04']

25. How to get the mean of a series grouped by another series?

In [30]:
fruit = pd.Series(np.random.choice(['apple', 'banana', 'carrot'], 10))
weights = pd.Series(np.linspace(1, 10, 10))
weights.groupby(fruit).mean
print(weights.tolist())
print(fruit.tolist())

[1.0, 2.0, 3.0, 4.0, 5.0, 6.0, 7.0, 8.0, 9.0, 10.0]
['banana', 'banana', 'carrot', 'carrot', 'carrot', 'apple', 'banana', 'carrot', 'banana', 'banana']

26. How to compute the euclidean distance between two series?

In [31]:
p = pd.Series([1, 2, 3, 4, 5, 6, 7, 8, 9, 10])
q = pd.Series([10, 9, 8, 7, 6, 5, 4, 3, 2, 1])
sum((p-q)**2)**.5

18.16590212458495

27. How to find all the local maxima(or peaks) in a numeric series?

In [32]:
ser=pd.Series([2,10,3,4,9,10,2,7,3])
dd=np.diff(np.sign(np.diff(ser)))
peak_loc=np.where(dd==-2)[0]+1
peak_loc

array([1, 5, 7], dtype=int64)

28. How to replace missing spaces in a string with the least frequent character?

In [33]:
my_str='dbc deb abed gade'
ser=pd.Series(list(my_str))
freq=ser.value_counts()
print(freq)
least_freq=freq.dropna().index[-1]
"".join(ser.replace(' ',least_freq))

d    4
b    3
     3
e    3
a    2
c    1
g    1
dtype: int64

'dbcgdebgabedggade'

29. How to create a dataframe with rows as strides from a given series?

In [34]:
L = pd.Series(range(15))
def gen_strides(a, stride_len=5, window_len=5):
    n_strides = ((a.size-window_len)//stride_len) + 1
    return np.array([a[s:(s+window_len)] for s in np.arange(0, a.size, stride_len)[:n_strides]])

gen_strides(L, stride_len=2, window_len=4)

array([[ 0,  1,  2,  3],
       [ 2,  3,  4,  5],
       [ 4,  5,  6,  7],
       [ 6,  7,  8,  9],
       [ 8,  9, 10, 11],
       [10, 11, 12, 13]], dtype=int64)

30. How to import only specified columns from a csv file?

In [35]:
df=pd.read_csv('./nuclear-explosion-data.csv',usecols=['country','type'])
df.head()

  country     type
0     USA    TOWER
1     USA  AIRDROP
2     USA  AIRDROP
3     USA  AIRDROP
4     USA       UW

31. How to change values when importing csv to a dataframe?

In [47]:
df = pd.read_csv('https://raw.githubusercontent.com/selva86/datasets/master/BostonHousing.csv', 
                 converters={'medv': lambda x: 'High' if float(x) > 25 else 'Low'})

32. How to get the nrows, ncolumns,datatype,summary stats of each column of a dataframe? Also get the array and list equivalent.

In [37]:
df=pd.read_csv('./nuclear-explosion-data.csv')
print("shape of the dataframe: ")
print("")
print(df.shape)
print("")
print("info of the dataframe: ")
print("")
print(df.info)
print("descriprition/stats of the dataframe ")
print("")
print(df.describe)
df_arr = df.values
df_list = df.values.tolist()

shape of the dataframe:

(2051, 16)

info of the dataframe:

<bound method DataFrame.info of           date      time     id   country      region source    lat    long  \
0     19450716  123000.0  45001       USA  ALAMOGORDO    DOE  32.54 -105.57
1     19450805  231500.0  45002       USA   HIROSHIMA    DOE  34.23  132.27
2     19450809   15800.0  45003       USA    NAGASAKI    DOE  32.45  129.52
3     19460630  220100.0  46001       USA      BIKINI    DOE  11.35  165.20
4     19460724  213500.0  46002       USA      BIKINI    DOE  11.35  165.20
...        ...       ...    ...       ...         ...    ...    ...     ...
2046  19960729   14859.1  96003     CHINA     LOP NOR    HFS  41.69   88.35
2047  19980511  101344.0  98001     INDIA     POKHRAN    HFS  27.07   71.70
2048  19980513   65100.0  98003     INDIA     POKHRAN    NRD  27.07   71.70
2049  19980528  101617.6  98004  PAKISTAN      CHAGAI    HFS  28.90   64.89
2050  19980530   65457.1  98005  PAKISTAN      KHARAN    HFS  28.49   63.78

       mb   Ms  depth  yield_lower  yield_upper purpose        name     type
0     0.0  0.0  -0.10         21.0         21.0      WR     TRINITY    TOWER
1     0.0  0.0  -0.60         15.0         15.0  COMBAT   LITTLEBOY  AIRDROP
2     0.0  0.0  -0.60         21.0         21.0  COMBAT      FATMAN  AIRDROP
3     0.0  0.0  -0.20         21.0         21.0      WE        ABLE  AIRDROP
4     0.0  0.0   0.03         21.0         21.0      WE       BAKER       UW
...   ...  ...    ...          ...          ...     ...         ...      ...
2046  5.3  0.0   0.00          3.0         12.0      WR         NaN       UG
2047  5.3  0.0   0.00          0.0         20.0      WR  SHAKTI 1-3       UG
2048  0.0  0.0   0.00          0.0          1.0      WR         NaN       UG
2049  0.0  0.0   0.00          0.0         35.0      WR         NaN       UG
2050  5.0  0.0   0.00          0.0         18.0      WR         NaN       UG

[2051 rows x 16 columns]>
descriprition/stats of the dataframe

<bound method NDFrame.describe of           date      time     id   country      region source    lat    long  \
0     19450716  123000.0  45001       USA  ALAMOGORDO    DOE  32.54 -105.57
1     19450805  231500.0  45002       USA   HIROSHIMA    DOE  34.23  132.27
2     19450809   15800.0  45003       USA    NAGASAKI    DOE  32.45  129.52
3     19460630  220100.0  46001       USA      BIKINI    DOE  11.35  165.20
4     19460724  213500.0  46002       USA      BIKINI    DOE  11.35  165.20
...        ...       ...    ...       ...         ...    ...    ...     ...
2046  19960729   14859.1  96003     CHINA     LOP NOR    HFS  41.69   88.35
2047  19980511  101344.0  98001     INDIA     POKHRAN    HFS  27.07   71.70
2048  19980513   65100.0  98003     INDIA     POKHRAN    NRD  27.07   71.70
2049  19980528  101617.6  98004  PAKISTAN      CHAGAI    HFS  28.90   64.89
2050  19980530   65457.1  98005  PAKISTAN      KHARAN    HFS  28.49   63.78

       mb   Ms  depth  yield_lower  yield_upper purpose        name     type
0     0.0  0.0  -0.10         21.0         21.0      WR     TRINITY    TOWER
1     0.0  0.0  -0.60         15.0         15.0  COMBAT   LITTLEBOY  AIRDROP
2     0.0  0.0  -0.60         21.0         21.0  COMBAT      FATMAN  AIRDROP
3     0.0  0.0  -0.20         21.0         21.0      WE        ABLE  AIRDROP
4     0.0  0.0   0.03         21.0         21.0      WE       BAKER       UW
...   ...  ...    ...          ...          ...     ...         ...      ...
2046  5.3  0.0   0.00          3.0         12.0      WR         NaN       UG
2047  5.3  0.0   0.00          0.0         20.0      WR  SHAKTI 1-3       UG
2048  0.0  0.0   0.00          0.0          1.0      WR         NaN       UG
2049  0.0  0.0   0.00          0.0         35.0      WR         NaN       UG
2050  5.0  0.0   0.00          0.0         18.0      WR         NaN       UG

[2051 rows x 16 columns]>

33. How to rename a specific columns in a dataframe?

In [38]:
df=pd.read_csv('nuclear-explosion-data.csv')
print(df.columns)
df=df.rename(columns={'lat':'latitude'})
df.columns

Index(['date', 'time', 'id', 'country', 'region', 'source', 'lat', 'long',
       'mb', 'Ms', 'depth', 'yield_lower', 'yield_upper', 'purpose', 'name',
       'type'],
      dtype='object')

Index(['date', 'time', 'id', 'country', 'region', 'source', 'latitude', 'long',
       'mb', 'Ms', 'depth', 'yield_lower', 'yield_upper', 'purpose', 'name',
       'type'],
      dtype='object')

34. How to check if a dataframe has any missing values?

In [39]:
df=pd.read_csv('nuclear-explosion-data.csv')
df.isnull().values.any()

True

35. How to count the number of missing values in each column?

In [40]:
df=pd.read_csv('nuclear-explosion-data.csv')
df.isnull().sum()

date             0
time             0
id               0
country          0
region           0
source           0
lat              0
long             0
mb               0
Ms               0
depth            0
yield_lower      3
yield_upper      5
purpose          1
name           665
type             0
dtype: int64

36. How to select a specific column from a dataframe as a dataframe instead of a series?

In [41]:
df = pd.DataFrame(np.arange(20).reshape(-1, 5), columns=list('abcde'))
type([df[['a']]])
type(df.loc[:,['a']])

pandas.core.frame.DataFrame

37. How tyo change the order of columns of a dataframe?

In [42]:
df = pd.DataFrame(np.arange(20).reshape(-1, 5), columns=list('abcde'))
df[list('cbade')]

    c   b   a   d   e
0   2   1   0   3   4
1   7   6   5   8   9
2  12  11  10  13  14
3  17  16  15  18  19

38. How to set the number of rows and columns displayed in the output?

In [43]:
df=pd.read_csv('nuclear-explosion-data.csv')
pd.set_option('display.max_columns', 10)
pd.set_option('display.max_rows', 10)
df

,date,time,id,country,region,...,yield_lower,yield_upper,purpose,name,type
0,19450716,123000.0,45001,USA,ALAMOGORDO,...,21.0,21.0,WR,TRINITY,TOWER
1,19450805,231500.0,45002,USA,HIROSHIMA,...,15.0,15.0,COMBAT,LITTLEBOY,AIRDROP
2,19450809,15800.0,45003,USA,NAGASAKI,...,21.0,21.0,COMBAT,FATMAN,AIRDROP
3,19460630,220100.0,46001,USA,BIKINI,...,21.0,21.0,WE,ABLE,AIRDROP
4,19460724,213500.0,46002,USA,BIKINI,...,21.0,21.0,WE,BAKER,UW
...,...,...,...,...,...,...,...,...,...,...,...
2046,19960729,14859.1,96003,CHINA,LOP NOR,...,3.0,12.0,WR,NaN,UG
2047,19980511,101344.0,98001,INDIA,POKHRAN,...,0.0,20.0,WR,SHAKTI 1-3,UG
2048,19980513,65100.0,98003,INDIA,POKHRAN,...,0.0,1.0,WR,NaN,UG
2049,19980528,101617.6,98004,PAKISTAN,CHAGAI,...,0.0,35.0,WR,NaN,UG
2050,19980530,65457.1,98005,PAKISTAN,KHARAN,...,0.0,18.0,WR,NaN,UG

39. How to format all the values in a dataframe as percentages?

In [44]:
df=pd.DataFrame(np.random.random(4),columns=['random'])
out=df.style.format({
    'random':'{0:.2%}'.format,
})
out

40. How t filter every nth row in a dataframe?

In [45]:
df=pd.read_csv('nuclear-explosion-data.csv')
print(df.iloc[::20,:][['country','type','purpose']])

     country      type purpose
0        USA     TOWER      WR
20       USA     TOWER      WR
40       USA     TOWER      WR
60       USA     BARGE      WR
80       USA   AIRDROP      WR
...      ...       ...     ...
1960  FRANCE  SHAFT/LG      WR
1980    USSR     SHAFT      WR
2000     USA     SHAFT      WR
2020  FRANCE  SHAFT/LG      WR
2040  FRANCE        UG      WR

[103 rows x 3 columns]

41. How to get the row number of the nth largest value in a column?

In [46]:
df = pd.DataFrame(np.random.randint(1, 30, 30).reshape(10,-1), columns=list('abc'))
print(df)
n=5
print(df['a'].argsort()[::-1][n])

    a   b   c
0  10   7  16
1  21  12  15
2  28  29  17
3   4  15  14
4   9  11  21
5   1  20  26
6  10  17   8
7   8   9  17
8  28   7   5
9  28   3  21
6

42. How to get the last n rows of a datafrme with row sum>100?

In [51]:
df=pd.DataFrame(np.random.randint(10,40,60).reshape(-1,4))
rowsum=df.apply(np.sum,axis=1)
last_2_rows=df.iloc[np.where(rowsum>100)[0][-2],:]
print(last_2_rows)

0    24
1    36
2    30
3    28
Name: 13, dtype: int32

43. How to swap two rows of a dataframe?

In [53]:
df=pd.DataFrame(np.arange(25).reshape(5,-1))
def swap_rows(df, i1, i2):
    a, b = df.iloc[i1, :].copy(), df.iloc[i2, :].copy()
    df.iloc[i1, :], df.iloc[i2, :] = b, a
    return df

print(swap_rows(df, 1, 2))

    0   1   2   3   4
0   0   1   2   3   4
1  10  11  12  13  14
2   5   6   7   8   9
3  15  16  17  18  19
4  20  21  22  23  24

44. Which column contains the highest number of rowwise maximum values?

In [54]:
df = pd.DataFrame(np.random.randint(1,100, 40).reshape(10, -1))
print('Column with highest row maxes: ', df.apply(np.argmax, axis=1).value_counts().index[0])

Column with highest row maxes:  0

45.  How to create a column containing the minimum by maximum of each row?

In [62]:
df = pd.DataFrame(np.random.randint(1,100, 80).reshape(8, -1))
min_by_max = np.min(df, axis=1)/np.max(df, axis=1)
min_by_max

0    0.213483
1    0.247191
2    0.012821
3    0.030612
4    0.070707
5    0.138298
6    0.262500
7    0.010753
dtype: float64

46.  How to create a column that contains the penultimate value in each row?

In [61]:
df = pd.DataFrame(np.random.randint(1,100, 80).reshape(8, -1))
out = df.apply(lambda x: x.sort_values().unique()[-2], axis=1)
df['penultimate'] = out
print(df)

    0   1   2   3   4  ...   6   7   8   9  penultimate
0   1  55   5  56  47  ...  49  63   6  32           63
1  49  64  31  20  60  ...   4  41  68  68           64
2  99  32  46  45  63  ...  37  29  49  26           94
3  56  58  27  62  15  ...  59  25  62  67           62
4  11  24  45  76  97  ...  43  77  58  75           77
5  80  37  24  90  16  ...  69  95  19  37           90
6  98  63  15  56  83  ...  58  87  93  60           93
7  51  11  23  30   1  ...  50  54  22  63           55

[8 rows x 11 columns]

47. How to normalize all columns in a dataframe?

In [60]:
df = pd.DataFrame(np.random.randint(1,100, 80).reshape(8, -1))
#normalising by subracting the col mean and div by std
out1 = df.apply(lambda x: ((x - x.mean())/x.std()).round(2))
print('Solution \n',out1)
#Range all columns of df such that the minimum value in each column is 0 and max is 1.
out2 = df.apply(lambda x: ((x.max() - x)/(x.max() - x.min())).round(2))
print('Solution \n', out2)

Solution
       0     1     2     3     4     5     6     7     8     9
0  1.00 -0.50 -0.44  0.21  0.71 -0.51 -0.33  0.48  0.05 -0.69
1 -0.71 -1.40 -0.33 -1.21  0.20  0.98  0.04 -1.18 -0.75  0.99
2  0.12  0.02 -1.29  0.11 -0.49 -1.34  1.36  0.25 -0.56  0.94
3 -0.11 -0.24  0.20 -1.21  0.85 -0.27  0.21  0.32 -0.91 -0.80
4  1.10  0.88  1.73  1.86  1.54  1.34 -1.18 -1.18 -0.27 -1.15
5 -1.92  1.01  0.99  0.66 -1.35 -1.16  1.50 -0.56  2.14 -0.80
6  0.73 -1.10 -1.00 -0.30 -0.39  0.09 -0.60  1.87  0.69  0.06
7 -0.20  1.31  0.13 -0.11 -1.07  0.86 -1.01  0.01 -0.40  1.44
Solution
       0     1     2     3     4     5     6     7     8     9
0  0.03  0.67  0.72  0.54  0.29  0.69  0.68  0.46  0.68  0.82
1  0.60  1.00  0.68  1.00  0.46  0.13  0.54  1.00  0.95  0.17
2  0.32  0.48  1.00  0.57  0.70  1.00  0.05  0.53  0.88  0.19
3  0.40  0.57  0.51  1.00  0.24  0.60  0.48  0.51  1.00  0.86
4  0.00  0.16  0.00  0.00  0.00  0.00  1.00  1.00  0.79  1.00
5  1.00  0.11  0.25  0.39  1.00  0.93  0.00  0.80  0.00  0.86
6  0.12  0.89  0.91  0.70  0.67  0.47  0.78  0.00  0.47  0.53
7  0.43  0.00  0.53  0.64  0.90  0.18  0.94  0.61  0.83  0.00

48.  How to replace both the diagonals of dataframe with 0?

In [58]:
df = pd.DataFrame(np.random.randint(1,100, 100).reshape(10, -1))
print(df)
for i in range(df.shape[0]):
    df.iat[i, i] = 0
    df.iat[df.shape[0]-i-1, i] = 0
print("after replacing")
print(df)

    0   1   2   3   4   5   6   7   8   9
0  97  30  86  90  63  87  46  14  47   9
1  22  70  15   6  70  88  13  36  65  63
2  43  98  36  91  98  52   3  78  87   1
3  84  81  10  29  49  56  98  53  86  92
4  24  47  31  62  45  86  56   8   1  40
5   1  80  38  22  73  20  27  17  81  47
6  12   8  78   3  57  98  28  30  55  63
7  60  16  79  39  56  67  41  59  24  17
8  54   9   2  25  99  53  96  80  36  19
9  34  72   8  75  29  51   7  53  27  46
after replacing
    0   1   2   3   4   5   6   7   8   9
0   0  30  86  90  63  87  46  14  47   0
1  22   0  15   6  70  88  13  36   0  63
2  43  98   0  91  98  52   3   0  87   1
3  84  81  10   0  49  56   0  53  86  92
4  24  47  31  62   0   0  56   8   1  40
5   1  80  38  22   0   0  27  17  81  47
6  12   8  78   0  57  98   0  30  55  63
7  60  16   0  39  56  67  41   0  24  17
8  54   0   2  25  99  53  96  80   0  19
9   0  72   8  75  29  51   7  53  27   0

49. How to get the frequency of unique values in the entire dataframe?

In [56]:
df = pd.DataFrame(np.random.randint(1, 10, 20).reshape(-1, 4), columns = list('abcd'))
pd.value_counts(df.values.ravel())

5    5
8    3
3    2
4    2
2    2
7    2
1    2
6    1
9    1
dtype: int64

50.  How to join two dataframes by 2 columns so they have only the common rows?

In [55]:
df1 = pd.DataFrame({'fruit': ['apple', 'banana', 'orange'] * 3,
                    'weight': ['high', 'medium', 'low'] * 3,
                    'price': np.random.randint(0, 15, 9)})

df2 = pd.DataFrame({'pazham': ['apple', 'orange', 'pine'] * 2,
                    'kilo': ['high', 'low'] * 3,
                    'price': np.random.randint(0, 15, 6)})